In [7]:
import pandas as pd

# Ans 1

In [8]:
data = [4,8,15,16,23,42]

In [10]:
series = pd.Series(data)

In [11]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Ans 2

In [12]:
data = [1,2,3,4,5,6,7,8,9,10];
print(type(data))

<class 'list'>

In [13]:
data

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [14]:
series = pd.Series(data)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Ans 3

In [19]:
data = {"Name":["Alice","Bob","Claire"],"Age" : [25,30,27],"Gender" : ["Female","Male","Female"]}
df = pd.DataFrame(data)

In [20]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Ans 4

DataFrame --> It is a 2-dimensional labeled data structure with columns of potentially different types.It is similar to a table or a spreadsheet, where data is organized in rows and columns. A DataFrame can be seen as a collection of Pandas Series,where each column represents a Series.

A Pandas Series, on the other hand, is a one-dimensional labeled array that can hold any data type.It is similar to a column in a DataFrame. Each element in a Series has a unique label called an index.

In [21]:
data1 = [4,8,15,16,23,42];

In [22]:
series = pd.Series(data1)

In [23]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [24]:
data2 = ({"Name" : ['Alice','Bob','Claire'],"Age" : [25,30,27],"Gender" : ["Female","Male","Female"]})

In [25]:
data = pd.DataFrame(data2)

In [26]:
data

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Ans 5

Since there are various functions in pandas to manipulate data. Some of them are :-

1.head() and tail()

These functions allow you to view the first or last few rows of a DataFrame, respectively. They are useful for inspecting the data or getting a quick overview.

In [27]:
df = pd.read_csv(r"C:\Users\hp\Downloads\taxonomy.csv.xls")

In [28]:
df.head()

  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3   101-02-01        Help Pay for Food    101-02  Emergency Cash
4   101-02-02  Help Pay for Healthcare    101-02  Emergency Cash

In [29]:
df.tail()

    taxonomy_id                          name parent_id           parent_name
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

2.info() -->

This function provides a summary of the DataFrame, including the column names,data types, and non-null values.It is useful for understanding the structure of the DataFrame.

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 290 entries, 0 to 289
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   taxonomy_id  290 non-null    object
 1   name         290 non-null    object
 2   parent_id    279 non-null    object
 3   parent_name  279 non-null    object
dtypes: object(4)
memory usage: 9.2+ KB

3. describe() --->

This function generates descriptive statistics of the DataFrame, such as count,mean,standard deviation,minimum,maximum, and quartile values.It provides a quick statistical summary of the data.

In [32]:
df.describe()

       taxonomy_id          name  parent_id       parent_name
count          290           290        279               279
unique         290           183         60                50
top            101  Nursing Home  106-06-07  Health Education
freq             1             4         11                15

4. shape() --->

This attribute returns the dimensions(rows and columns) of the DataFrame as a tuple.

In [33]:
df.shape

(290, 4)

5. fillna() -->

This function if used to fill missing values in the DataFrame with a specified values or a strategy like forward fill or backward fill

In [34]:
df.fillna("Kushal")

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency    Kushal                Kushal
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]

# Ans 6

Among the options provided, the mutable(modifiable) data structure in pandas is the DataFrame.Both Series and Panel are immutable, meaning their values cannot be changed once they are created.However, DataFrame allows for modifications, such as adding or removing rows and columns, updating values, or applying various data transformations.

# Ans 7

In [35]:
name = pd.Series(['Kushal','Agrawal','sudh'])
age = pd.Series([25,34,23])
city = pd.Series(['Kota','Noida','Jaipur'])

In [36]:
data = {'Name' : name,'Age' : age,'City' : city}
df = pd.DataFrame(data)

In [37]:
df

      Name  Age    City
0   Kushal   25    Kota
1  Agrawal   34   Noida
2     sudh   23  Jaipur